[
    {
        "id": 1,
        "title": "Vegetable Stew",
        "ingredients": "2 medium potatoes (peeled and cut into 1 inch cubes), 1 medium carrot (cut into ½ inch cubes), 6-8 French beans (cut into 1 inch pieces), ½ cup frozen green peas, 1 tbsp coconut oil, 1 inch cinnamon stick, 2-3 star anise, 6-8 black peppercorns, 3-4 cloves, 5-6 curry leaves, 2-3 green chillies (slit), 1 large onion (sliced), 1 tbsp ginger-garlic paste, Salt to taste, Crushed black peppercorns to taste, 1½ cups coconut milk, Coriander sprig for garnish",
        "procedure": "Press “sauté” mode on the Nutripot, add coconut oil in it and let it heat up. Add cinnamon stick, star anise, black peppercorns, cloves, curry leaves, green chillies and sauté till fragrant. Add onions, ginger-garlic paste and sauté till translucent. Add potatoes, carrot and sauté well. Add French beans, green peas, salt and crushed black peppercorns and mix well.Add coconut milk and mix well. Press cancel, cover and cook on veg currymode (i.e. for 15 minutes). After 5 minutes the pressure will be released. Lock the pressure by turning the whistle in left or right direction and let it cook for the remaining time. Once 15 minutes are over, the cooker will go on “Keep Warm” mode, press “Cancel” and let the pressure settle down, open the Nutripot lid. Pour the vegetable stew in a serving bowl. Garnish with a coriander sprig and serve hot. ",
        "videoId": "JUCldIjdCxc",
        "imageUrl": "https://th.bing.com/th/id/OIP.XWoMGX7z-a0na5iPcN1g6QHaE3?w=259&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 2,
        "title": "Choco Cookie Shake",
        "ingredients": "12 chocolate cookies, 8 tbsps chocolate sauce, 2 cups chilled milk, 8 scoops vanilla ice cream, Ice cubes (as required), 6 vanilla cream chocolate cookies",
        "procedure": " Break the cookies and put into a blender jar, add chocolate sauce, 1 cup milk and blend till smooth. Add vanilla ice cream, remaining milk, ice cubes and blend again. Remove cream from the vanilla cream cookies and crush the cookies. Pour the milk shake into tall glasses, put the foam on the top, cover it up completely with cookies and serve immediately.",
        "videoId": "eACMDJnOiD0",
        "imageUrl": "https://th.bing.com/th/id/OIP.XiW0FVHnp89h2AjQiB9dXQHaFa?w=202&h=147&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 3,
        "title": "Baked Kachori",
        "ingredients": "½ cup split skinless black gram (dhuli urad dal) soaked, 1 tbsp chopped ginger, 1 green chilli (chopped), 2 tbsps oil, ¼ tsp asafoetida, 1 tsp coriander powder, ½ tsp cumin powder, 1 tsp red chilli powder, ½ tsp fennel (saunf) powder, 2 cups refined flour (maida), Salt to taste, ¼ tsp baking powder, 2 tbsps ghee + for brushing",
        "procedure": " Drain and put split black gram in a chopper, add ginger, green chilli and crush coarsely.  Heat oil in a non-stick wok, add asafoetida and crushed mixture and saute for 3-4 minutes. Add ½ cup water, coriander powder, cumin powder, red chilli powder, fennel powder and salt and mix well. Cover and cook till dry. Put refined flour in a bowl, add salt, baking powder and 2 tbsps ghee and mix well. Add sufficient water and knead into a stiff dough. Cover the bowl with cling film and rest the dough for 15 minutes. When gram mixture becomes dry, transfer it into another bowl and let it cool. Preheat oven to 180° C. Divide the dough into equal portions and shape into balls.  Apply a little oil to each ball, press them slightly and roll out into small puris with the edges being thinner than the centre. Place some of the gram mixture in the centre, dampen the edges, bring them together and press to seal. Press slightly and roll into small puris ensuring that the filling is evenly spread. Grease a baking tray, place the kachoris in it, brush them with a little ghee and bake in the preheated oven at 200° C for about 15 minutes or till the kachoris are cooked and golden. Arrange them on a serving plate and serve hot.",
        "videoId": "YkjB5jZbFKA",
        "imageUrl": "https://th.bing.com/th/id/OIP.lsDrkxEdZvOZEJTLEpORSQHaEK?w=271&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 4,
        "title": "Mutton Sekuwa",
        "ingredients": "400 grams boneless mutton (cut into 2 inch cubes), ½ cup onion paste, ½ cup thick yogurt, 1 tsp cumin powder, 1 tsp red chilli powder, ½ tsp turmeric powder, 1 tsp garam masala powder + for sprinkling, 1 tsp red chilli flakes, 1½ tbsps ginger-garlic paste, 2-3 tbsps mustard oil + for basting, Salt to taste, 1 tbsp lemon juice, Onion rings to serve, Lemon wedges to serve",
        "procedure": "Take mutton cubes in a large bowl. Add onion paste, thick yogurt, cumin powder, red chilli powder, turmeric powder, garam masala powder, red chilli flakes, ginger-garlic paste, mustard oil, salt, lemon juice and mix well. Set aside to marinate for 1 hour. Thread a few pieces of mutton on to individual skewers.  Heat sufficient charcoal on direct flame in a barbeque. Arrange the mutton skewers and cook for 8-10 minutes, rotating in between few minutes and basting with mustard oil occasionally. Carefully remove the mutton pieces from the skewers into a bowl, sprinkle garam masala powder. Serve hot with onion rings and lemon wedges.",
        "videoId": "WArh9CVg81s",
        "imageUrl": "https://th.bing.com/th/id/OIP.MlWwnddaiWLRrvnzxDDNagHaEc?w=297&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 5,
        "title": "Garlic Sweet Potato Soup",
        "ingredients": "2 medium sweet potatoes (peeled cut into 1 inch cube), 12-15 garlic cloves, 1 tbsp olive oil, 1 tbsp butter, 1 tbsp finely chopped celery, 1 medium onion roughly chopped, Salt to taste, Crushed black peppercorn to taste, 3 cups vegetable stock, ¼ cup milk, Fresh thyme for garnish, Garlic oil for garnish",
        "procedure": "Heat olive oil in nonstick deep pan, add butter, add garlic cloves and sauté till it becomes golden brown. Add celery and mix well, add onion mix and sauté till it turns translucent. Add sweet potatoes and mix well, add salt and crushed black peppercorn and mix. Pore the vegetable stock and mix well and let the mixture come to boil. Cover and cook for 15-20 minutes. Switch the heat off and blend the mixture till smooth using an electric hand blender. Add milk and mix till well combined. Transfer the soup in a serving bowl, garnish with garlic oil, fresh thyme and sprinkle some crushed black peppercorn and serve hot.",
        "videoId": "EYHz3TVZhTQ",
        "imageUrl": "https://th.bing.com/th/id/OIP.cqMW7dS_mpsA0xI2iABjnAHaEo?w=255&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 6,
        "title": "Lal Mirch Keema",
        "ingredients": "500 grams mutton mince, 5 thick fresh red chillies, 2 tbsps ghee, 1 tsp cumin seeds, 4 green cardamoms, 1 inch cinnamon stick, 1 bay leaf, 2 medium onions (sliced), 1½ tbsps chopped ginger, 1½ tbsps chopped garlic, 2-3 green chillies (chopped), ½ tsp turmeric powder, 1 tbsp coriander powder, 1½ tsps red chilli powder, Salt to taste, 2 tbsps yogurt, 1 tsp garam masala powder, 4-6 tbsps chopped fresh coriander leaves, ¼ lemon, Fresh coriander sprigs for garnish",
        "procedure": "Remove the stems and seeds from the chillies. Heat ghee in a pan. Add cumin seeds and once they start to change the colour, add green cardamoms, cinnamon and bay leaf and sauté till fragrant. Add onions and sauté till translucent. Add ginger, garlic and green chillies and sauté for a minute. Add mutton mince and sauté for 3-4 minutes on high heat. Add turmeric powder, coriander powder, red chilli powder, salt and yogurt and mix well. Cook till fat separates. Add garam masala powder, 2-3 tbsps coriander and mix well.  Squeeze lemon directly in the pan and mix well. Stuff the chillies with prepared mince mixture and add these stuffed chillies in remaining mince mixture. Add ½ cup water, cover and cook for 10-15 minutes on medium heat. Add remaining coriander and mix well. Transfer in a serving plate, garnish with coriander sprigs and serve hot.",
        "videoId": "yObU_-HjCZo",
        "imageUrl": "https://th.bing.com/th/id/OIP.wqLFU1BQqC-92QC2PQq0UAHaE8?w=272&h=181&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 7,
        "title": "Goan Chicken Croquettes",
        "ingredients": "250 grams chicken mince, 1 tbsp vinegar, Salt to taste, 1 ½ tbsps ginger-garlic paste, 2-3 tbsps oil, ½ inch cinnamon, 3-4 cloves, 2 medium onions (chopped), 1 medium tomato (chopped), 2-3 green chillies (chopped), ½ tsp turmeric powder, 1 tsp red chilli powder, 2 eggs, 2-3 medium potatoes (boiled + peeled + mashed), ½ cup dried breadcrumbs + for coating, Oil for deep frying, Tomato ketchup for serving",
        "procedure": " Take chicken mince in a bowl. Add vinegar, salt and ginger-garlic paste and mix well. Set aside for 10-15 minutes.  Heat oil in a nonstick pan. Add cinnamon and cloves and sauté till fragrant. Add onions and sauté for 3-4 minutes. Add tomato, green chillies and salt and cook on medium heat till the tomatoes are pulpy. Add turmeric powder, red chilli powder and mix well. Add chicken mince and cook on high heat for 5-6 minutes. Take the pan off the heat and allow to cool. Transfer the mixture in a grinder jar and grind to fine mixture. Transfer in a bowl, break egg, add boiled potatoes, breadcrumbs and mix well. Divide the mixture into equal portions and roll into cylinders. Break another egg in a bowl and whisk well. Spread dried breadcrumbs evenly on a plate. Heat sufficient oil in a kadai. Dip the croquettes and roll in breadcrumbs and deep fry till golden brown and crisp.  Drain on absorbent paper and serve hot with tomato ketchup.",
        "videoId": "u394toa0sqI",
        "imageUrl": "https://th.bing.com/th/id/OIP.iQFBkwceBXOjoVAo8ODAPQHaEL?w=309&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 8,
        "title": "Mutton Masala",
        "ingredients": "750 grams mutton (cut into 2 inch pieces on the bone), ½ cup yogurt, ½ tsp turmeric powder, Salt to taste, 2 tbsps red chilli paste, ½ lemon, ¼ cup ghee, 1 tsp cumin seeds, 3-4 green cardamoms, 1 black cardamom, 2 inch cinnamon stick, 2 bay leaves, 5-6 cloves, 6-8 black peppercorns, 2 large onions (finely chopped), 1 tbsp ginger-garlic paste, 2 large tomatoes (finely chopped), 2½ tsps red chilli powder, 2 tsps coriander powder, 1 tsp cumin powder, ½ tsp turmeric powder, 2-3 green chillies (slit + for garnish), 2 tbsps chopped fresh coriander leaves, ½ tsp garam masala powder, Ginger strips for garnish, Fresh coriander sprigs for garnish, Phulkas to serve, Onion slices to serve, Fresh mint leaves to serve, Lemon wedges to serve",
        "procedure": "Take mutton in a large bowl, add yogurt, turmeric powder, salt, red chilli paste, and squeeze the juice of lemon and mix well. Marinate for 35-40 minutes. Heat ghee in a handi. Add cumin seeds, green cardamoms, black cardamom, cinnamon stick, bay leaves, cloves, and black peppercorns, and sauté till fragrant. Add onions and sauté till golden brown. Add ginger-garlic paste, mix and cook for 1-2 minutes. Add the mutton and sauté on high heat for 3-4 minutes. Add tomatoes, mix and cook till soft and pulpy. Reduce the heat to low, add red chilli powder, coriander powder, cumin powder, turmeric powder, and mix well. Add salt, mix and cook for 2-3 minutes. Add 2 cups water, mix, cover with a lid and cook for 45-50 minutes.  Remove the lid, and continue to cook for 10-15 minutes or till the mixture thickens. Add green chillies, coriander leaves, and garam masala powder and mix well. Transfer into a serving bowl, garnish with ginger strips, green chillies, and coriander sprigs. Serve hot with phulkas, onion slices, mint leaves, and lemon wedges.",
        "videoId": "sTtKom9NtcQ",
        "imageUrl": "https://th.bing.com/th/id/OIP.NvI0LXjt97pNOcpnGU5KHwHaD4?w=342&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 9,
        "title": "Kung Pao Prawns",
        "ingredients": "15-20 medium prawns (shelled and deveined), Salt to taste, 3 tbsps corn flour, Crushed black peppercorns to taste, Oil for deep-frying, 1 tbsp sesame oil, 1 tbsp chopped garlic, ½ tbsp chopped ginger, 2 dried red chillies (stemmed and broken), 1 tsp red chilli paste, 3-4 spring onion bulbs (sliced), ½ cup prawn stock, 1 tbsp soy sauce, 1 tbsp red chilli sauce, ¼ tsp sugar, 1 cup mixed capsicum triangles, 2 tbsps cornflour slurry, ¼ cup roasted peanuts, ¼ cup diagonally sliced spring onion greens + for garnish",
        "procedure": "Take prawns in bowl, add salt, cornflour and crushed peppercorns, mix well and set aside for 10-15 minutes. Heat sufficient oil in a kadai. Deep-fry prawns till crisp and golden brown. Drain on absorbent paper. Heat sesame oil in a non-stick pan. Add garlic and ginger, mix and sauté for a minute. Add red chillies and mix well. Add red chilli paste and mix well. Add spring onion bulbs and sauté for a minute. Add ¼ cup prawn stock, mix and cook for a minute. Add soy sauce, red chilli sauce, salt and sugar, mix well. Add mixed bell pepper, and mix well and continue to cook for a minute. Add remaining prawn stock and corn flour slurry, mix well and cook for 1-2 minutes. Add in the fried prawns, roasted peanuts, and spring onion greens and mix till well combined. Transfer the prawns in serving bowl and garnish with spring onion greens and serve hot.",
        "videoId": "2t1jUm50myU",
        "imageUrl": "https://th.bing.com/th/id/OIP.NAPPl2GDz8wHFrj0a13-fwHaEK?w=202&h=113&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 10,
        "title": "Aloo Kofta Curry",
        "ingredients": "2-3 tbsps oil, 1 tsp cumin seeds, 2 tbsps chopped garlic, 1 tbsp chopped ginger, 2-3 green chillies (chopped), 2 medium onions (chopped), Salt to taste, 1 cup fresh tomato puree, 1 tsp red chilli powder, 1 tbsp coriander powder, 1 tsp cumin powder, ½ tsp turmeric powder, 2 tbsps cashew nut paste, ¼ cup grated khoya (mawa), 1 tbsp tomato ketchup, 2 tsps dried fenugreek leaves (kasoori methi), ¼ tsp garam masala powder, 2-3 tbsps chopped fresh coriander leaves + for garnish, 3 medium potatoes (boiled, peeled and mashed), Salt to taste, ½ tsp garam masala powder, ½ tsp red chilli powder, 1 tbsp chopped fresh coriander leaves, 2 tbsps corn flour + for coating, Oil for applying + for deep frying, Parantha for serving",
        "procedure": "Heat oil in a nonstick pan, add cumin seeds once they change colour, add garlic, ginger and green chillies and sauté for a minute. Add onions, salt and sauté till golden brown. Add tomato puree, cover and cook till oil separates. Add red chilli powder, coriander powder, cumin powder and turmeric powder and sauté for a minute. Add 2½ cups water, stir well. Add cashew nut paste, mawa and tomato ketchup. Cover and cook for 5-6 minutes. Take potatoes in a bowl. Add salt, garam masala powder, red chilli powder, coriander leaves and corn flour and mix well. Apply oil on your palms, take a portion of the potato mixture and shape into a ball, coat with corn flour. Heat sufficient oil in a kadai and deep fry koftas until golden brown in colour. Drain on an absorbent paper. Add kasoori methi, garam masala and coriander leaves to the gravy and mix well. Pour the gravy in a serving bowl and arrange the fried koftas on top. Sprinkle coriander leaves and serve hot with paranthas.",
        "videoId": "h237FfpiWrQ",
        "imageUrl": "https://th.bing.com/th/id/OIP.bkEAzSJGbXQtWmJnNfvvywHaD4?w=331&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 11,
        "title": "Aloo Khulcha",
        "ingredients": "4-5 medium potatoes (boiled, peeled, and grated), 1½ cups refined flour (maida), Salt to taste, ½ tsp baking powder, ¼ tsp baking soda, 1 tsp castor sugar, 2 tbsps melted ghee, 2 tbsps yogurt, ½ cup milk, 1½ tbsps coriander seeds, 1½ tsp cumin seeds, 1 tsp red chilli powder, 1 tbsp chopped ginger, 1 tbsp dried mango powder (amchur), 2 tsps dried pomegranate (anardana) powder, ½ tsp black salt, Salt to taste, 3-4 green chillies (chopped), 3 tbsps chopped fresh coriander leaves, 1-2 medium onions (chopped), Oil for drizzling, Salt water for sprinkling, Butter for spreading, Chole for serving, Onion tamarind chutney for serving",
        "procedure": "Take flour in a bowl, add salt, baking powder, baking soda and sugar. Add 1¾ tbsps melted ghee and mix well. Add yogurt and milk, mix well. Add ½ cup water and knead into a soft dough. Apply remaining ghee over the dough. Cover with a damp muslin cloth and set aside for 30-40 minutes. Dry roast the coriander seeds and cumin seeds in a small non-stick pan for 1-2 minutes. Transfer into a mortar and coarsely crush it with a pestle. Take potatoes in another bowl, add 2 tsps of the coriander-cumin mixture, red chilli powder, ginger, dried mango powder, dried pomegranate powder, black salt, salt, green chillies, coriander and onions. Mix well. Divide the dough into equal portions and drizzle some oil. Cover with a damp muslin cloth and set aside for 10-15 minutes. Heat an iron tawa. Take a portion of the dough and stuff it with a portion of the potato mixture. Set aside for 5 minutes. Sprinkle salt water on the hot tawa. Dust some flour on the worktop, place the stuffed dough over it and lightly flatten it with the help of your fingers. Roll it gently with a rolling pin into a disc. Apply water on one side of the disc and sprinkle coriander leaves, along with some of the remaining coriander-cumin mixture. Apply water on the other side as well and place it on the hot tawa with the coriander side facing up. Cook for 1 minute and then flip the tawa and cook the other side over the direct flame for another minute. Remove the khulcha on a plate and spread butter on top. Serve hot with chole and onion tamarind chutney.",
        "videoId": "tlDUoLUR5Z4",
        "imageUrl": "https://th.bing.com/th/id/OIP.8NuEDgCPSbcUptzicQfytwHaE7?w=264&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 12,
        "title": "Crispy Mushroom Fritters",
        "ingredients": "16-20 small button mushrooms, 1 cup refined flour, 1 tsp garlic powder, 1 tsp paprika powder, Crushed black peppercorns to taste, Salt to taste, ½ tsp dried mixed herbs, 1 tsp onion powder, ½ tsp red chilli flakes, 2 tbsps chopped fresh parsley, Crushed cornflakes as required, Oil for deep frying, Tartar sauce for serving",
        "procedure": "Take refined flour in a bowl. Add garlic powder, paprika powder, crushed black peppercorns, salt, dried mixed herbs, onion powder, red chilli flakes, parsley and 1¼ cups water and whisk well. Dip the mushrooms in refined flour mixture and roll in cornflakes. Heat sufficient oil in a kadai. Slide the crumbed mushrooms and deep fry till golden brown and crisp. Drain on absorbent paper and serve hot with tartar sauce.",
        "videoId": "d0wynshy35c",
        "imageUrl": "https://th.bing.com/th/id/OIP.BEbN4wF7OOEi7PAwBOtXvAHaFP?w=234&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 13,
        "title": "Tandoori Thai Broccoli",
        "ingredients": "8 blanched broccoli florets, 2 tbsps yellow Thai curry paste, ¾ cup hung yogurt, Salt to taste, 1 kaffir lime, Salad for serving",
        "procedure": "Preheat the oven to 180˚C. Take hung yogurt in a mixing bowl, add yellow Thai curry paste and salt. Zest kaffir lime directly in the bowl and mix well. Add blanched broccoli florets and mix well. Set aside to marinate for 10-15 minutes. Transfer the broccoli pieces on a greased baking tray and bake for 10-15 minutes. Arrange on a serving plate and serve with salad.",
        "videoId": "UV69jcpuuJI",
        "imageUrl": "https://th.bing.com/th/id/OIP.oldgyC8Gs8o_iQ4WYfZY2wHaE8?w=299&h=199&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 14,
        "title": "Dilli Wala Masala Chicken",
        "ingredients": "400 grams chicken leg boneless (cut into 1-inch pieces), 2 tbsps ginger-garlic paste, Salt to taste, 2½ tsps red chilli powder, 2 tsps + 1 tbsp coriander powder, 3 tsps cumin powder, 6 tbsps oil, 2 tsps cumin seeds, 1 inch cinnamon stick, 3 dried red chillies (stemmed and broken), 4 medium onions (chopped), 3 medium tomatoes (pureed), 1 tsp garam masala powder, 1 tbsp pav bhaji masala, ¼ tsp dried fenugreek leaves (kasuri methi) powder, ½ cup whisked yogurt, ¼ cup chopped fresh coriander leaves, Juice of ½ lemon, Fresh coriander sprigs for garnish, Onion rings for serving, Paranthas for serving",
        "procedure": "Take chicken pieces in a bowl. Add ginger-garlic paste, salt, 1 tsp red chilli powder, 2 tsps coriander powder, 1 tsp cumin powder and mix well. Set aside to marinate for 10-15 minutes. Meanwhile, to prepare the masala, heat 4 tbsps oil on a big tawa. Add cumin seeds and once they start to change color, add cinnamon, dried red chilies and sauté for 30 seconds. Add onions and cook on medium heat till they turn golden brown. Add tomato puree and cook on medium heat till oil separates. Add remaining red chilli powder, remaining coriander powder, remaining cumin powder, garam masala powder, pav bhaji masala, and kasuri methi powder and mix well. Cook for 2-3 minutes. Add yogurt and cook till the masala is thick and oil separates. Heat remaining oil in a shallow nonstick pan. Add chicken pieces and sauté on high heat for 5-6 minutes. Add the cooked chicken to the masala, add coriander, 1 cup water and mix well. Cook on medium heat for 3-4 minutes. Add lemon juice and mix well. Transfer to a serving bowl, garnish with coriander sprigs and serve hot with onion rings and paranthas.",
        "videoId": "BjQxQHTvQ10",
        "imageUrl": "https://th.bing.com/th/id/OIP.BH0yyYLoCEryiJyB1MfH1gHaFj?w=229&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 15,
        "title": "French Toast",
        "ingredients": "1 brioche bread loaf, 6 eggs, 2 tsps vanilla essence, ¼ cup powdered sugar, 1 cup milk, ½ cup butter, Chocolate spread as required, Peanut butter spread as required, Fresh mixed berries (strawberries and blueberries) for serving, Crème fraiche for serving, Fresh mint sprig for garnish",
        "procedure": "Break eggs in a shallow wide bowl, add vanilla essence, powdered sugar, and milk, and whisk well. Slice the brioche bread into 8 thick slices. Apply a portion of peanut butter on one side of 4 bread slices and apply the chocolate spread on one side of the remaining bread slices. Place this over the peanut buttered slices with the chocolate side facing downward to make sandwiches. Dip each sandwich in the egg mixture. Heat butter in a nonstick pan and gently place the soaked sandwich on it. Cook on medium heat for 1-2 minutes on each side. Cut the French toast in half. Serve hot with strawberries and crème fraiche garnished with a mint sprig.",
        "videoId": "UxlI821bB48",
        "imageUrl": "https://th.bing.com/th/id/OIP.W8Z0ZD-7sAc9ymOAXxC0WwHaDt?w=202&h=169&c=7&r=0&o=5&dpr=1.3&pid=1.7"
    },
    {
        "id": 16,
        "title": "Arbi Ke Kabab",
        "ingredients": "15-20 colocassia (arbi), 1 tsp cumin seeds, ½ tsp carom seeds (ajwain), 1 tbsp chopped ginger, 2 tsps chopped green chillies, 10-12 fresh mint leaves, Salt to taste, 1 tsp chaat masala, ½ tsp crushed black peppercorns, Oil to shallow fry, Onion rings to garnish, Thin strips of green, red, and yellow capsicum, to garnish",
        "procedure": "1. Heat sufficient water in a deep non-stick pan, add colocassia and boil till soft. Cool, peel, and mash.\n2. Dry roast cumin seeds and carom seeds till fragrant. Cool, transfer into a mortar and crush.\n3. Place ginger and green chillies in a deep bowl. Chop mint leaves and add. Add mashed colocassia, salt, chaat masala, cumin-carom seed powder, and crushed black peppercorns and mix well with greased hands.\n4. Heat a little oil in a non-stick pan. Shape the mixture into evenly sized round kababs. (You can make the kababs in advance and keep them in the refrigerator till it is time to shallow fry.)\n5. Shallow fry the kababs, turning sides, till evenly golden and crisp on both sides.\n6. Serve hot garnished with onion rings and thin strips of green, red, and yellow capsicum.",
        "videoId": "e7W4zx3qoMs",
        "imageUrl": "https://th.bing.com/th/id/OIP.5Ey-0SLDDJWSqmnQpTRRPQHaE8?w=257&h=180&c=7&r=0&o=5&dpr=1.3&pid=1.7"
      }
      
]